{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert-base-multilingual-cased",
  "bias": "all",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 384,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 320,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_lin",
    "out_lin",
    "q_lin",
    "k_lin"
  ],
  "task_type": "TOKEN_CLS",
  "use_rslora": false
}